<a href="https://colab.research.google.com/github/nureeee/numpy-pandas/blob/main/210521_%EC%98%A4%ED%9B%84%EC%88%98%EC%97%85.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpyas np

In [4]:
d1 = pd.DataFrame( {'name' : ['이순신', '황진이', '신돌석', '강감찬'],
                  'job' : ['공무원', '가수', '골목대장', '공무원']})
d2 = pd.DataFrame( {'p_name' : ['이순신', '황진이', '이순신', '강감찬'],
                  'project' :['A', 'A', 'B', 'C']})

In [6]:
pd.merge(d1, d2, left_on= 'name', right_on= 'p_name').drop('name', axis=1)

   job p_name project
0  공무원    이순신       A
1  공무원    이순신       B
2   가수    황진이       A
3  공무원    강감찬       C

In [8]:
pd.merge(d1, d2, how='outer', left_on= 'name', right_on= 'p_name').drop('name', axis=1)

    job p_name project
0   공무원    이순신       A
1   공무원    이순신       B
2    가수    황진이       A
3  골목대장    NaN     NaN
4   공무원    강감찬       C

In [9]:
d1

  name   job
0  이순신   공무원
1  황진이    가수
2  신돌석  골목대장
3  강감찬   공무원

In [10]:
d2

  p_name project
0    이순신       A
1    황진이       A
2    이순신       B
3    강감찬       C

In [11]:
print(d1,'\n\n' ,d2)

  name   job
0  이순신   공무원
1  황진이    가수
2  신돌석  골목대장
3  강감찬   공무원

   p_name project
0    이순신       A
1    황진이       A
2    이순신       B
3    강감찬       C